{"description": "BUFR Table C - Data description operators",
    "headers": ["F", "X", "Operand", "Name", "Definition"],
    "entries": [
        ["2", "01", "YYY", "Change data width", "Add (YYY-128) bits to the data width given for each data element in Table B, other than CCITT IA5 (character) data, code or flag tables."],
        ["2", "02", "YYY", "Change scale", "Add YYY-128 to the scale for each data element in Table B, other than CCITT IA5 (character) data, code or flag tables."],
        ["2", "03", "YYY", "Change reference values", "Subsequent element descriptors define new reference values for corresponding Table B entries. Each new reference value is represented by YYY bits in the Data section. Definition of new reference values is concluded by coding this operator with YYY = 255. Negative reference values shall be represented by a positive integer with the left-most bit (bit 1) set to 1."],
        ["2", "04", "YYY", "Add associated field", "Precede each data element with YYY bits of information. This operation associates a data field (e.g. quality control information) of YYY bits with each data element."],
        ["2", "05", "YYY", "Signify character", "YYY characters (CCITT International Alphabet No. 5) are inserted as a data field of YYY x 8 bits in length."],
        ["2", "06", "YYY", "Signify data width for the immediately following local descriptor", "YYY bits of data are described by the immediately following descriptor."],
        ["2", "07", "YYY", "Increase scale, reference value and data width", "For Table B elements, which are not CCITT IA5 (character data), code tables, or flag tables: 1. Add YYY to the existing scale factor 2. Multiply the existing reference value by 10YYY 3. Calculate ((10 x YYY) + 2) / 3, disregard any fractional remainder and add the result to the existing bit width."],
        ["2", "08", "YYY", "Change width of CCITT IA5 field", "YYY characters from CCITT International Alphabet No. 5 (representing YYY x 8 bits in length) replace the specified data width given for each CCITT IA5 element in Table B."],
        ["2", "21", "YYY", "Data not present", "Data values present in Section 4 (Data section) corresponding to the following YYY descriptors shall be limited to data from Classes 01-09, and Class 31."],
        ["2", "22", "000", "Quality information follows", "The values of Class 33 elements which follow relate to the data defined by the data present bit-map."],
        ["2", "23", "000", "Substituted values operator", "The substituted values which follow relate to the data defined by the data present bit-map."],
        ["2", "23", "255", "Substituted values marker operator", "This operator shall signify a data item containing a substituted value; the element descriptor for the substituted value is obtained by the application of the data present bit-map associated with the substituted values operator."],
        ["2", "24", "000", "First-order statistical values follow", "The statistical values which follow relate to the data defined by the data present bit-map."],
        ["2", "24", "255", "First-order statistical values marker operator", "This operator shall signify a data item containing a first-order statistical value of the type indicated by the preceding 0 08 023 element descriptor; the element descriptor to which the first-order statistic relates is obtained by the application of the data present bit-map associated with the first-order statistical values follow operator; first-order statistical values shall be represented as defined by this element descriptor."],
        ["2", "25", "000", "Difference statistical values follow", "The statistical values which follow relate to the data defined by the data present bit-map."],
        ["2", "25", "255", "Difference statistical values marker operator", "This operator shall signify a data item containing a difference statistical value of the type indicated by the preceding 0 08 024 element descriptor; the element descriptor to which the difference statistical value relates is obtained by the application of the data present bit-map associated with the difference statistical values follow operator; difference statistical values shall be represented as defined by this element descriptor, but with a reference value of -2n and a data width of (n+1), where n is the data width given by the original descriptor. This special reference value allows the statistical difference values to be centred around zero."],
        ["2", "32", "000", "Replaced/retained values follow", "The replaced/retained values which follow relate to the data defined by the data present bit-map."],
        ["2", "32", "255", "Replaced/retained value marker operator", "This operator shall signify a data item containing the original of an element which has been replaced by a substituted value. The element descriptor for the retained value is obtained by the application of the data present bit-map associated with the substituted values operator."],
        ["2", "35", "000", "Cancel backward data reference", "This operator terminates all previously defined back- ward reference and cancels any previously defined data present bit-map; it causes the next data present bit-map to refer to the data descriptors which immediately precede the operator to which it relates."],
        ["2", "36", "000", "Define data present bit-map", "This operator defines the data present bit-map which follows for possible re-use; only one data present bit-map may be defined between this operator and the cancel use defined data present bit-map operator."],
        ["2", "37", "000", "Use defined data present bit-map", "This operator causes the defined data present bit-map to be used again."],
        ["2", "37", "255", "Cancel use defined data present bit-map", "This operator cancels the re-use of the defined data present bit-map."],
        ["2", "41", "000", "Define event", "This operator denotes the beginning of the definition of an event (see Note 19)."],
        ["2", "41", "255", "Cancel define event", "This operator denotes the conclusion of the event definition that was begun via the previous 2 41 000 operator."],
        ["2", "42", "000", "Define conditioning event", "This operator denotes the beginning of the definition of a conditioning event (see Note 19)."],
        ["2", "42", "255", "Cancel define conditioning event", "This operator denotes the conclusion of the conditioning event definition that was begun via the previous 2 42 000 operator."],
        ["2", "43", "000", "Categorical forecast values follow", "The values which follow are categorical forecast values (see Note 20)."],
        ["2", "43", "255", "Cancel categorical forecast values follow", "This operator denotes the conclusion of the definition of categorical forecast values that was begun via the previous 2 43 000 operator."]
    ]
}
